{
  "presentation://section_1_Hook": {
    "uri": "presentation://section_1_Hook",
    "path": "presentation/section_1_Hook",
    "name": "section_1_Hook",
    "item_type": "Resource",
    "checksum": "6a894a6bc0ae27f8c5520efb39ad4456",
    "change_log": [
      {
        "timestamp": "2025-06-09T12:53:57.465926Z",
        "action": "ITEM_DISCOVERED_ON_DISK_NEW",
        "user": null,
        "old_value": null,
        "new_value": "cs:6a894a6bc0ae27f8c5520efb39ad4456",
        "details": null
      }
    ],
    "status": "new",
    "parent_type_uri": "type://presentation",
    "definition_file_path": "presentation/section_1_Hook/section_1_Hook.md",
    "content": "# SECTION 1: Hook / Introduction - Your Vision & The AI Context\n\nI'm the kind of person, that if given a 5 minute task, I'll make a tool to make the task in 5s, but that'll take me 5hours\n\nI'm always thinking that Computer are tools, to automate the repetive tasks.\n\nBut today they are obviously a lot more than that.\n(short pause)\nToday they are incredibly capable smart assistant.\n\n(short pause)\nYou know they actually predict the next word in a sentence. Everybody uses it, and you can see the stream of words coming. It stops when it's enough.\n\nWhen we worked for the game Tetris at EA Mobile, we used AI to predict how players would make their next move. A very similar process to what large language models do, but that was 14 years ago.\n\n(short pause)\n\nWe had to bring in the best Tetris players in the world to play the game and collect data. That was a lot of fun.\n\n(short pause)\n\nThis isn't new; we've been doing that for years. It's just that now, thanks to the deep learning models we're getting very good at it.\n(pause)\n\n(short pause)\n\nAI can create art, music, write code, play games, pretty much anything.\n\n(short pause)\n\nBut this brings a big question: If AI can automate so much of the production… what’s our role as creators?\n\n(short pause)\n\nIf they do all the work what's left for us to do?\n\n(short pause)\n\nHow do we stay in control and use this amazing power, instead of feeling overwhelmed by it?\n\n(significant pause)\n\n---\n\n",
    "links": [],
    "linked_from": []
  },
  "type://presentation": {
    "uri": "type://presentation",
    "path": "presentation",
    "name": "presentation",
    "item_type": "ResourceTypeDefinition",
    "checksum": "bfd4881b54b3195de73cbd09ba13b07f",
    "change_log": [
      {
        "timestamp": "2025-06-09T12:53:57.466093Z",
        "action": "ITEM_DISCOVERED_ON_DISK_NEW",
        "user": null,
        "old_value": null,
        "new_value": "cs:bfd4881b54b3195de73cbd09ba13b07f",
        "details": null
      }
    ],
    "status": "new",
    "definition_file_path": "presentation/presentation.md",
    "content": "This regroups all the sections for the presentation\n\n"
  },
  "presentation://section_2_Why": {
    "uri": "presentation://section_2_Why",
    "path": "presentation/section_2_Why",
    "name": "section_2_Why",
    "item_type": "Resource",
    "checksum": "091b6ac293f003289cde240d7e82e812",
    "change_log": [
      {
        "timestamp": "2025-06-09T12:53:57.466125Z",
        "action": "ITEM_DISCOVERED_ON_DISK_NEW",
        "user": null,
        "old_value": null,
        "new_value": "cs:091b6ac293f003289cde240d7e82e812",
        "details": null
      }
    ],
    "status": "new",
    "parent_type_uri": "type://presentation",
    "definition_file_path": "presentation/section_2_Why/section_2_Why.md",
    "content": "# SECTION 2: \\\"THE WHY\\\" - Challenges & Opportunities (The Chess Analogy)\n\nTo understand our problem, let's look at what happened in the world of chess.\n\n(short pause)\n\nAI has been beating the best human players for a long time. Think back to the 90s – Kasparov competing against Deep Blue. Since then, AI has become the undisputed world chess champion. The best chess AIs don't even need to study human games anymore to improve.\n\n(pause)\n\nBut here’s the interesting part: even though AI is the best player, more people are playing chess than ever before!\n\n(short pause)\n\nWhy? Because chess players use AI every day. Not necessarily because AI is the most *fun* opponent, but because it's the **best way to get better at chess**. They use AI to practice, to deeply analyze their games, and to prepare their strategies for playing against other humans.\n(pause)\nThe chess community accepted AI as a powerful training partner, an essential tool for improvement... not an enemy.\n\nThis chess story is a great lesson for all of us in creative fields. We should see AI as an opportunity – an opportunity to learn, to get better at what we are already good at, what we like to do.\n\n(short pause)\n\nNow that's not the only interesting aspect of AI in chess. Think about how those chess programs evolved: before modern AI, like LLMs and Transformers, the best chess engines were built with millions of lines of complex, hand-crafted code. Now? It's more like one big \"brain\" that largely trains itself on the game.\n\n(short pause)\n\nWhy? Because even if it's a lot more complexe to train and build a big ai brain, using it is quite trivial and  actually easy to manipulate and control. It's a lot easier than to write millions of lines of code.\n\n(short pause)\n\nYes, behind the scene, this new approach is a lot more efficient, and also a lot more powerful. The beauty of it: it can adapt to all our existing tools. From the 3D tools to Spreadsheets, or any form of data, it will be a lot easier to use as we will be able to prompt the AI to do what we want on any form of data.\n\n(short pause)\n\nBut yes, there’s a lot of worry right now, especially in video games. These AIs can create things that seem as good as, or even better than, what some humans can do… just like in chess.\n\n(short pause)\n\nSo the big question is: how do we use AI constructively, and stay in control?\n\n(significant pause)",
    "links": [],
    "linked_from": []
  },
  "presentation://section_3_What": {
    "uri": "presentation://section_3_What",
    "path": "presentation/section_3_What",
    "name": "section_3_What",
    "item_type": "Resource",
    "checksum": "55aa8f4e2e62309a14af1f8b72f76230",
    "change_log": [
      {
        "timestamp": "2025-06-09T12:53:57.466150Z",
        "action": "ITEM_DISCOVERED_ON_DISK_NEW",
        "user": null,
        "old_value": null,
        "new_value": "cs:55aa8f4e2e62309a14af1f8b72f76230",
        "details": null
      }
    ],
    "status": "new",
    "parent_type_uri": "type://presentation",
    "definition_file_path": "presentation/section_3_What/section_3_What.md",
    "content": "# SECTION 3: \\\"THE WHAT\\\" - Your Solution (The Need for Description & Approval)\n\nWe need to understand what we are trying to achieve when we say, making a Game. Let's start smaller, with a simpler art form, like a painting.\n\nThink about modern art. Sometimes you see a plain white canvas in a museum, signed by an artist. Making a white canvas isn't technically hard.\n\n(short pause)\n\nBut it’s there, signed. The artist’s idea, their intent, their gift to the world, and their choice to show it – It is art because of the artist's will. \n\n(short pause)\n\nAI can paint the canvas, but who will sign it?\nWe need artists, coders, and other experts? \nAbsolutely, YES, to gather ideas, bring them to life, and to sign the canvas.\n\n(short pause)\n\nBeing an expert, in many ways, grants you the ability to **describe something precisely**. It's about truly knowing how that thing works. A director of photography sees and can describe light, shadow, and reflection in detail. A programmer sees and understands the logic within lines of code.\n\n(short pause)\n\nIt's this deep understanding, this ability to articulate the essence, that we need. We need experts to craft the detailed descriptions that will guide AI, to critique what AI produces against a well-defined creative intent, and ultimately, to put their name on the final work and take responsibility for it.\n(short pause)\n\nIt’s the same with AI. Imagine an AI making an eight-hour movie from one command. That’s impressive! But would you put your name on it without checking it, without agreeing it’s what you wanted?\n\n(short pause)\n\nYou will see bad results from amateurs, willing to use AI to create something without any real understanding of what they are doing. And that is totally normal. But it will be unlikley for them to connect with an audience. They will sure be \nFor big projects, we need to spend hours looking, judging, and approving. A product is ready when the team agrees it’s good, when they all back the creative idea.\n\nAnd that’s just how creating things works. Think about making a movie. There are steps you *can't* skip, like making a storyboard. It’s not just a task; it’s a key part of defining the story.\n(short pause)\nAny project is really a collection of connected \"data\" or \"ingredients\" – characters, places, props, scripts, art ideas, references, lighting. This \"data\" is the real heart of the project.\n\nSo, for us creators using AI, two things are essential:\n(short pause)\nFirst, we need a way to **describe our ideas very clearly**. This clear description is what will guide the AI.\n(pause)\nSecond, we need to **always have access to, and control over, this descriptive data**. No temporary files that disappear. As professionals, we need to create this data, check it, improve it, and approve it.\n\nSo, I asked myself: What kind of tool, what way of working, could **help experts do their best work** with AI?\n(short pause)\nHow could we give them an easy and effective way to work together, while keeping control and being clear? How can a team look at their project data together, with everyone bringing their own expertise?\n\nAnswering these questions led me to develop an approach… a method I call VibeLogic.\n(short pause)\nIt’s based on using the smart AI agents that are already on our computers and in the tools we use every day.\n(pause)\nThe main idea is to organize our work, our descriptions, so these AI agents can help us in the best way. The VibeLogic tool then helps **support this method**. It makes it easier to structure the data, and it gives a clear view of how things are organized and if they’re approved. It’s a **service** for experts, to help them with these needs.\n\n---\n",
    "links": [],
    "linked_from": []
  }
}